[
  {
    "title": "Pine",
    "tabLabel": "Development",
    "tabPosition": 1,
    "slug": "pine",
    "caseStudy": true,
    "overview": "Pine is a web application designed to simplify dining decisions by helping users find restaurants and discover recipes based on their preferences. Pine eliminates the frustration of meal planning, offering personalized recommendations for both dining out and cooking at home.",
    "summary": "Pine is a web application designed to simplify dining decisions by helping users find restaurants and discover recipes based on their preferences. Pine eliminates the frustration of meal planning, offering personalized recommendations for both dining out and cooking at home.",
    "year": 2024,
    "folderColor": "var(--folder-1)",
    "roles": ["Lead Designer", "Lead Developer", "Project Manager"],
    "tools": ["Figma", "Next.js", "Node.js", "Spoonacular API", "Google Maps API", "Adobe After Effects", "Adobe Illustrator", "Lottie"],
    "image": "/images/pine/Thumbnail.jpg",
    "categories": ["Development", "UI/UX Design", "Case Study"],
    "externalLinks": [{"href": "https://pine-app.vercel.app/", "text": "Check It Out"}],
    "branding": {
      "logo": "/images/pine/PineLogo.svg",
      "fonts": [
        { "name": "Oswald", "style": "Heading" },
        { "name": "Poppins", "style": "Body" }
      ],
      "colors": [
        {
          "name": "Charcoal",
          "hex": "#2B3F47",
          "rgb": [43, 63, 71],
          "hsl": [200, 25, 22]
        },
        {
          "name": "Mint Cream",
          "hex": "#EFFFF8",
          "rgb": [239, 255, 248],
          "hsl": [150, 100, 97]
        },
        {
          "name": "Mint Green",
          "hex": "#C2EEE1",
          "rgb": [194, 238, 225],
          "hsl": [164, 56, 85]
        },
        {
          "name": "Myrtle Green",
          "hex": "#46757C",
          "rgb": [70, 117, 124],
          "hsl": [188, 27, 38]
        }
      ],
      "animation": "/images/pine/pine-animation.webm"
    },
    "caseStudySections": [
      {
        "heading": "01. Problem & Persona",
        "text": "56.8% of post secondary students struggle with meal planning—whether it’s deciding where to eat or finding recipes that fit their dietary preferences and budget. **Pine** solves this by offering a streamlined web app that curates both restaurant suggestions and recipe recommendations based on user preferences. \n\n The ideal user is a busy young professional or student who values convenience and health but Pine is made for anyone who's hungry.",
        "layout": "row"
      },
      {
        "heading": "02. User Flow",
        "text": "After the ideal user was established, the flow was designed. The goal was to intuitively guide users through each phase in as few steps as possible.",
        "figmaEmbedLink": "https://www.figma.com/file/CxUggvw8b9vrQTK2ioP5JE/MDIA-2106-Pine?node-id=1522-3685",
        "layout": "row"
      },
      {
        "heading": "03. Lo-fi Development",
        "text": " Low-fidelity wireframes were created in Figma, mapping out key interactions such as onboarding, personalized meal selection, and restaurant discovery.",
        "beforeAfterImages": {
          "before": "/images/pine/before.jpg",
          "after": "/images/pine/after.jpg"
        },
        "layout": "row"
      },
      {
        "heading": "04. Branding & Style Guide",
        "text": "Pine's branding is designed to be inclusive and inviting with a pine-tree mascot and earth-tone colors, while the **Oswald and Poppins** typefaces ensure readability with a bit of personality. A **custom Lottie animation** of the Pine mascot flipping a pancake adds personality and engagement to loading screens.",
        "layout": "row"
      },
      {
        "heading": "05. Hi-fi Development",
        "text": "High-fidelity mockups were created to visualize the final product, showcasing the app’s user interface, interactive elements, and overall aesthetic. The design was refined through user testing to ensure a seamless experience.",
        "figmaEmbedLink": "https://www.figma.com/design/CxUggvw8b9vrQTK2ioP5JE/MDIA-2106-%E2%80%93-Pine-SET-G-%E2%80%93-Revision?node-id=0-1&t=xBRkuq7UHUCpDJod-1",
        "layout": "row"
      },
      {
        "heading": "06. User Testing",
        "text": "User testing was conducted to evaluate Pine’s navigation, clarity, and overall user experience. Participants completed task-based scenarios, revealing key areas for improvement, such as clearer ingredient labeling, enhanced discoverability of recipe steps, and improved button placement. Feedback led to refinements in UI elements, terminology, and layout adjustments to ensure a more intuitive and seamless experience.",
        "layout": "row"
      },
      {
        "heading": "Main Functionality",
        "text": "Pine offers **two core functions**:  \n **Restaurant Finder** – Users select a craving (Asian, Western, fast food, desserts, etc.), and Pine suggests nearby restaurants.  \n **Recipe Finder** – Users can browse recipes, view full ingredient lists, and follow step-by-step instructions.",
        "layout": "left-column",
        "image": "/images/pine/2Phone.png"
      },
      {
        "heading": "Development & Integration",
        "text": "The app is powered by **Spoonacular API** for meal recommendations and **Google Maps API** for interactive restaurant listings. A **custom-built database** organizes dish data, and a graph component visualizes nutritional information in real-time.",
        "layout": "right-column",
        "image": "/images/pine/MapsAPI.png"
      },
      {
        "heading": "Core Features",
        "text": "**Personalized Quiz** – Gathers user preferences for tailored recommendations.  \n**Restaurant Map (WOW Feature)** – Displays interactive restaurant cards using Google Maps API.  \n**Recipe & Shopping List** – Offers step-by-step instructions and an ingredient list.",
        "layout": "left-column",
        "image": "/images/pine/2Features.png"
      },
      {
        "heading": "Conclusion",
        "text": "Pine simplifies meal planning, ensuring users can quickly discover dining options or cook meals tailored to their needs. This project included a balance of UI/UX design, branding, and technical development, making it an accessible and friendly user-centric application.",
        "layout": "right-column",
        "image": "/images/pine/Nutrition.png"
      },
      {
        "heading": "07. Lessons Learned",
        "text": "Developing Pine highlighted the importance of user-centered design and iterative testing. User feedback emphasized the need for clear labeling, intuitive navigation, and accessibility considerations. Refining UI elements based on real-world interactions improved the overall experience, reinforcing the value of continuous testing and adaptation in product development.",
        "layout": "row"
      }
    ]
  },
  {
    "slug": "kenzo-tange-magazine",
    "title": "Kenzo Tange Magazine",
    "tabLabel": "Graphic Design",
    "tabPosition": 2,
    "caseStudy": false,
    "summary": "This magazine spread pays tribute to the architectural legacy of Kenzo Tange, emphasizing his influence on modern urban design. A visible grid system structures the layout, reflecting the modularity and precision in Tange’s work while enhancing visual cohesion.",
    "image": "/images/kenzo-magazine/Thumbnail.jpg",
    "categories": ["Graphic Design", "Editorial Design", "Print"],
    "externalLinks": [
      {
        "href": "https://indd.adobe.com/view/fdf8a8d1-8f87-4529-892e-0b74825b4605",
        "text": "Digital Version"
      },
      {
        "href": "https://indd.adobe.com/view/d1b1f696-5ec8-4bba-8b31-35b027511b5a",
        "text": "Print Version"
      }
    ],
    "year": 2024,
    "folderColor": "var(--folder-2)",
    "overview": "This magazine spread pays tribute to the architectural legacy of Kenzo Tange, emphasizing his influence on modern urban design. A visible grid system structures the layout, reflecting the modularity and precision in Tange’s work while enhancing visual cohesion. The typography is bold, structured and highly pricice, referencing the geometric forms found in his architecture. Inspired by the raw aesthetic of brutalist design, the color palette is minimal, allowing focus to be placed on the images of Tange's architecture. Through a carefully balanced composition, this magazine presents a refined narrative that connects Tange’s visionary approach to contemporary architecture.",
    "tools": ["Adobe InDesign", "Adobe Photoshop"],
    "images": [
        { "src": "/images/kenzo-magazine/SingleSpread.jpg", "type": "normal" },
        { "src": "/images/kenzo-magazine/Spreads.jpg", "type": "normal" }

      ],
    "upNext": {
      "slug": "fathom-summer-series",
      "title": "Fathom Summer Series",
      "image": "/images/can-design/ThreeCanMockup.png",
      "categories": ["Graphic Design", "Packaging", "Branding"]
    }
  },
  {
    "slug": "fathom-summer-series",
    "title": "Fathom Summer Series",
    "tabLabel": "Packaging",
    "tabPosition": 3,
    "caseStudy": false,
    "summary": "The Fathom Summer Series was created to capture the essence of summer through a line of craft beers, each inspired by a distinct time of day. Designed for Canadian consumers, the series balances vibrant visuals with bilingual labeling to meet packaging standards while reflecting the adventurous, geometric identity of the Fathom brand.",
    "image": "/images/can-design/Thumbnail.jpg",
    "categories": ["Graphic Design", "Packaging", "Branding"],
    "year": 2024,
    "folderColor": "var(--folder-3)",
    "overview": "The Fathom Summer Series was created to capture the essence of summer through a line of craft beers, each inspired by a distinct time of day. Designed for Canadian consumers, the series balances vibrant visuals with bilingual labeling to meet packaging standards while reflecting the adventurous, geometric identity of the Fathom brand.\n\n### Bold, Geometric Design\nEach can features sharp, geometric fruit illustrations that align with Fathom’s brand style, emphasizing clean shapes and bold lines. Brand cohesion is maintained through this consistent aesthetic, with a unifying line graphic tying the series together.\n\n### Flavours Inspired by Summer\n- **Dawn Rise** (Blood Orange & Ginger Wheat Ale) captures the energy of morning.\n- **Golden Hour** (Mango & Pineapple Pale Ale) reflects the brightness of midday.\n- **Twilight Berry** (Blackberry & Lavender Saison) evokes the calm of twilight.\n\n### Custom Iconography\nIcons highlight key flavour profiles like crispness and malt, giving consumers a clear sense of what to expect while adding depth to the design.\n\n### Shelf Appeal\nWith vibrant colors, bold graphics, and a clear story, the Fathom Summer Series stands out on shelves, inviting consumers to experience the adventure of summer through Fathom’s unique lens.",
    "tools": ["Adobe Illustrator", "Adobe Photoshop"],
    "images": [
        { "src": "/images/can-design/TwilightBerryCanMock.jpg", "type": "can" },
        { "src": "/images/can-design/GoldenHourCanMock.jpg", "type": "can" },
        { "src": "/images/can-design/DawnRiseCanMock.jpg", "type": "can" },
        { "src": "/images/can-design/TwilightBerryDieline.png", "type": "dieline" },
        { "src": "/images/can-design/GoldenHourDieline.png", "type": "dieline" },
        { "src": "/images/can-design/DawnRiseDieline.png", "type": "dieline" }
      ],
    "upNext": {
      "slug": "coltrane-ellington",
      "title": "Coltrane and Ellington",
      "image": "/images/magazine/MagazineCoverImage.png",
      "categories": ["Graphic Design", "Poster"]
    }
  },
  {
    "slug": "coltrane-ellington",
    "title": "Coltrane and Ellington",
    "tabLabel": "Poster",
    "tabPosition": 4,
    "caseStudy": false,
    "summary": "This poster was created to honour jazz icons Duke Ellington and John Coltrane, blending retro and modern elements to pay tribute to their timeless legacy. The orange and purple color palette was chosen to reflect the original album artwork, creating a visual homage to their collaboration.",
    "image": "/images/jazz-poster/MagazineCoverImage.png",
    "categories": ["Graphic Design", "Poster"],
    "year": 2024,
    "folderColor": "var(--folder-4)",
    "overview": "This poster was created to honour jazz icons Duke Ellington and John Coltrane, blending retro and modern elements to pay tribute to their timeless legacy. The orange and purple color palette was chosen to reflect the original album artwork, creating a visual homage to their collaboration. The typeface used for their names draws inspiration from 1960s design trends while incorporating a contemporary twist, balancing nostalgia with modern aesthetics.\n\nTo integrate the sourced images seamlessly into the design, Coltrane and Ellington were posterized. This approach added elegance, enhanced balance, and unified the composition. The warm, dynamic visuals and bold typography create a striking design that captures the energy and sophistication of jazz. Perfect for music lovers and collectors, this poster serves as a fitting tribute to two of the greatest legends in jazz history.",
    "tools": ["Adobe Illustrator", "Adobe Photoshop"],
    "images":[
        { "src": "/images/jazz-poster/PostersUnderTheBridge.png", "type": "normal" },
        { "src": "/images/jazz-poster/BedroomMockup.png", "type": "normal" }
      ],
    "upNext": {
      "slug": "fathom-summer-series",
      "title": "Fathom Summer Series",
      "image": "/images/can-design/ThreeCanMockup.png",
      "categories": ["Graphic Design", "Packaging", "Branding"]
    }
  },
  {
    "slug": "Relay-Promotional-Video",
    "title": "Relay Promotional Video",
    "tabLabel": "Videography",
    "tabPosition": 2,
    "caseStudy": false,
    "summary": "This promotional video highlights the real-life challenges parents face when arranging transportation for their children and how Relay offers a seamless solution.",
    "image": "/images/relay-video/RelayVideoThumbnail.jpg",
    "categories": ["Marketing", "Videography", "Video Editing"],
    "externalLinks": [{"href": "https://drive.google.com/file/d/193ki24JhSamZv_oj-9GOjzA5p6x__zew/view?usp=sharing", "text": "Check It Out"}],
    "year": 2024,
    "folderColor": "var(--folder-1)",
    "overview": "This promotional video highlights the real-life challenges parents face when arranging transportation for their children and how **Relay** offers a seamless solution. It opens with three contrasting scenarios: a child walking alone in the rain because their parent is too busy to drive, a mother and child stranded at a bus stop when the bus never arrives, and a father forced to stay late at work while his child waits for him. These moments emphasize the stress and uncertainty that come with unreliable transportation. The narrative then shifts to parents using Relay, showcasing how the app connects them for convenient carpooling, ensuring safe and reliable rides. The video’s **cinematic storytelling, and relatable scenarios** bring the benefits of Relay to life, making it an engaging and persuasive tool for parents looking for a dependable rideshare solution.",
    "tools": ["Adobe Premiere Pro", "Adobe Illustrator"],
    "upNext": {
      "slug": "fathom-summer-series",
      "title": "Fathom Summer Series",
      "image": "/images/can-design/ThreeCanMockup.png",
      "categories": ["Graphic Design", "Packaging", "Branding"]
    }
  },
  {
    "slug": "Local-Harvest-Motion-Graphic",
    "title": "Local Harvest Motion Graphic",
    "tabLabel": "Animation",
    "tabPosition": 3,
    "caseStudy": false,
    "summary": "This motion graphic promotes an app that connects farmers with consumers for pre-ordering goods before market day. It highlights the common challenges farmers face, showcasing how the app reduces waste and improves planning.",
    "image": "/images/lh-animation/LHAnimationThumbnail.png",
    "categories": ["Marketing", "Motion Design", "Animation"],
    "externalLinks": [{"href": "https://drive.google.com/file/d/1NGq74N_F7ytIAaSJdT2AVRAGkOkd7Wa5/view?usp=sharing", "text": "Check It Out"}],
    "year": 2024,
    "folderColor": "var(--folder-2)",
    "overview": "This motion graphic promotes an app that connects farmers with consumers for pre-ordering goods before market day. It opens with contrasting scenes of overstocked and understocked stalls, immediately highlighting the common challenges farmers face. The narrative then shifts to a farmer discovering the app, followed by consumers placing orders, showcasing how the app reduces waste and improves planning. The video uses bright, geometric visuals and playful animations to make the app feel approachable and user-friendly. Happy customers emphasize the app’s role in building community connections. By visually demonstrating the app’s benefits in a simple, engaging way, the motion graphic effectively captures attention and encourages both farmers and consumers to use Local Harvest.",
    "tools": ["Adobe Illustrator", "Adobe After Effects"],
    "upNext": {
      "slug": "fathom-summer-series",
      "title": "Fathom Summer Series",
      "image": "/images/can-design/ThreeCanMockup.png",
      "categories": ["Graphic Design", "Packaging", "Branding"]
    }
  }
]