[
  {
    "slug": "fathom-summer-series",
    "title": "Fathom Summer Series",
    "caseStudy": false,
    "image": "/images/can-design/ThreeCanMockup.png",
    "categories": ["Graphic Design", "Packaging", "Branding"],
    "year": 2024,
    "overview": "The Fathom Summer Series was created to capture the essence of summer through a line of craft beers, each inspired by a distinct time of day. Designed for Canadian consumers, the series balances vibrant visuals with bilingual labeling to meet packaging standards while reflecting the adventurous, geometric identity of the Fathom brand.\n\n### Bold, Geometric Design\nEach can features sharp, geometric fruit illustrations that align with Fathom’s brand style, emphasizing clean shapes and bold lines. Brand cohesion is maintained through this consistent aesthetic, with a unifying line graphic tying the series together.\n\n### Flavours Inspired by Summer\n- **Dawn Rise** (Blood Orange & Ginger Wheat Ale) captures the energy of morning.\n- **Golden Hour** (Mango & Pineapple Pale Ale) reflects the brightness of midday.\n- **Twilight Berry** (Blackberry & Lavender Saison) evokes the calm of twilight.\n\n### Custom Iconography\nIcons highlight key flavour profiles like crispness and malt, giving consumers a clear sense of what to expect while adding depth to the design.\n\n### Shelf Appeal\nWith vibrant colors, bold graphics, and a clear story, the Fathom Summer Series stands out on shelves, inviting consumers to experience the adventure of summer through Fathom’s unique lens.",
    "tools": ["Adobe Illustrator", "Adobe Photoshop"],
    "images": [
        { "src": "/images/can-design/TwilightBerryCan.png", "type": "can" },
        { "src": "/images/can-design/GoldenHourCan.png", "type": "can" },
        { "src": "/images/can-design/DawnRiseCan.png", "type": "can" },
        { "src": "/images/can-design/TwilightBerryDieline.png", "type": "dieline" },
        { "src": "/images/can-design/GoldenHourDieline.png", "type": "dieline" },
        { "src": "/images/can-design/DawnRiseDieline.png", "type": "dieline" }
      ],
    "upNext": {
      "slug": "coltrane-ellington",
      "title": "Coltrane and Ellington",
      "image": "/images/magazine/MagazineCoverImage.png",
      "categories": ["Graphic Design", "Poster"]
    }
  },
  {
    "slug": "coltrane-ellington",
    "title": "Coltrane and Ellington",
    "caseStudy": false,
    "image": "/images/jazz-poster/MagazineCoverImage.png",
    "categories": ["Graphic Design", "Poster"],
    "year": 2024,
    "overview": "This poster was created to honour jazz icons Duke Ellington and John Coltrane, blending retro and modern elements to pay tribute to their timeless legacy. The orange and purple color palette was chosen to reflect the original album artwork, creating a visual homage to their collaboration. The typeface used for their names draws inspiration from 1960s design trends while incorporating a contemporary twist, balancing nostalgia with modern aesthetics.\n\nTo integrate the sourced images seamlessly into the design, Coltrane and Ellington were posterized. This approach added elegance, enhanced balance, and unified the composition. The warm, dynamic visuals and bold typography create a striking design that captures the energy and sophistication of jazz. Perfect for music lovers and collectors, this poster serves as a fitting tribute to two of the greatest legends in jazz history.",
    "tools": ["Adobe Illustrator", "Adobe Photoshop"],
    "images":[
        { "src": "/images/jazz-poster/PostersUnderTheBridge.png", "type": "normal" },
        { "src": "/images/jazz-poster/BedroomMockup.png", "type": "normal" }
      ],
    "upNext": {
      "slug": "fathom-summer-series",
      "title": "Fathom Summer Series",
      "image": "/images/can-design/ThreeCanMockup.png",
      "categories": ["Graphic Design", "Packaging", "Branding"]
    }
  },
  {
    "slug": "Local-Harvest-Motion-Graphic",
    "title": "Local Harvest Motion Graphic",
    "caseStudy": false,
    "image": "/images/lh-animation/LHAnimationThumbnail.png",
    "categories": ["Marketing", "Motion Design", "Animation"],
    "externalLink": "https://drive.google.com/file/d/1NGq74N_F7ytIAaSJdT2AVRAGkOkd7Wa5/view?usp=sharing",
    "year": 2024,
    "overview": "This motion graphic promotes an app that connects farmers with consumers for pre-ordering goods before market day. It opens with contrasting scenes of overstocked and understocked stalls, immediately highlighting the common challenges farmers face. The narrative then shifts to a farmer discovering the app, followed by consumers placing orders, showcasing how the app reduces waste and improves planning. The video uses bright, geometric visuals and playful animations to make the app feel approachable and user-friendly. Happy customers emphasize the app’s role in building community connections. A cheerful, folk-inspired soundtrack and friendly voiceover create an inviting tone. By visually demonstrating the app’s benefits in a simple, engaging way, the motion graphic effectively captures attention and encourages both farmers and consumers to use Local Harvest.",
    "tools": ["Adobe Illustrator", "Adobe After Effects"],
    "upNext": {
      "slug": "fathom-summer-series",
      "title": "Fathom Summer Series",
      "image": "/images/can-design/ThreeCanMockup.png",
      "categories": ["Graphic Design", "Packaging", "Branding"]
    }
  },
  {
    "title": "Pine",
    "slug": "pine",
    "caseStudy": true,
    "introduction": "Pine is a web application designed to simplify dining decisions by helping users find restaurants and discover recipes based on their preferences and budget. Through a seamless user experience, Pine eliminates the frustration of meal planning, offering personalized recommendations for both dining out and cooking at home.",
    "year": 2024,
    "tools": ["Figma", "Next.js", "Node.js", "Spoonacular API", "Google Maps API", "Adobe Illustrator", "Lottie"],
    "image": "/images/pine/Thumbnail.png",
    "categories": ["Development", "UI/UX Design", "Case Study"],
    "externalLink": "https://pine-app.vercel.app/",
    "caseStudySections": [
      {
        "heading": "Lo-Fi & Architecture",
        "text": "The project began with ideation, market research, and user personas to define the needs of the target audience. Initial low-fidelity wireframes were created in Figma, focusing on user flows for onboarding, restaurant discovery, and recipe selection.",
        "image": "/images/pine/Thumbnail.png"
      },
      {
        "heading": "Key Lo-Fi Contributions",
        "text": "• Designed the Onboarding & Quiz flow, including the landing page, tutorial screens, and mascot animation.\n• Structured the directories and pages, such as category pages, dish descriptions, locations, FAQs, and shopping lists.\n• Developed core components, including buttons, headers, progress indicators, and popups for seamless navigation.",
        "image": "/images/pine/Thumbnail.png"
      },
      {
        "heading": "Branding & Style Guide",
        "text": "To establish a cohesive and inviting visual identity, Pine’s branding was designed with clarity and warmth in mind.",
        "image": "/images/pine/Thumbnail.png"
      },
      {
        "heading": "Key Branding Elements",
        "text": "• Logo Design: Multiple variations created to ensure versatility across digital platforms.\n• Color Palette & Typography: Selected to balance modern minimalism with approachability.\n• Illustrations & Animations: Custom Lottie animations, including the mascot flipping a pancake as a loading screen.",
        "image": "/images/pine/Thumbnail.png"
      },
      {
        "heading": "Main Features & Development",
        "text": "The technical implementation involved front-end development, API integration, and database architecture to create a dynamic and scalable application.",
        "image": "/images/pine/Thumbnail.png"
      },
      {
        "heading": "Core Features Developed",
        "text": "✔ Personalized Quiz – Integrated with Spoonacular API to tailor meal recommendations.\n✔ Restaurant Map (WOW Feature) – Utilized Google Maps API to display interactive restaurant cards.\n✔ Dynamic Dish Descriptions – Created a database for dishes and a graph component to visualize nutritional data.\n✔ Recipe & Shopping List Integration – Designed seamless ingredient and step-by-step instruction pages.\n✔ Reusable Components – Developed buttons, search bars, popups, and snackbars for UI consistency.",
        "image": "/images/pine/Thumbnail.png"
      },
      {
        "heading": "Conclusion",
        "text": "Pine was built to remove the frustration of meal decisions, empowering users to enjoy effortless dining whether they’re eating out or cooking at home. The project showcases a strong blend of UI/UX design, branding, and technical development, demonstrating a well-rounded approach to problem-solving in digital product design.",
        "image": "/images/pine/Thumbnail.png"
      }
    ],
    "additionalImages": [
      "/images/pine/Thumbnail.png",
      "/images/pine/Thumbnail.pngg",
      "/images/pine/Thumbnail.png"
    ]
  }
]