[
  {
    "title": "Pine",
    "slug": "pine",
    "caseStudy": true,
    "overview": "Pine is a web application designed to simplify dining decisions by helping users find restaurants and discover recipes based on their preferences. Pine eliminates the frustration of meal planning, offering personalized recommendations for both dining out and cooking at home.",
    "year": 2024,
    "tools": ["Figma", "Next.js", "Node.js", "Spoonacular API", "Google Maps API", "Adobe After Effects", "Adobe Illustrator", "Lottie"],
    "image": "/images/pine/Thumbnail.png",
    "categories": ["Development", "UI/UX Design", "Case Study"],
    "externalLink": "https://pine-app.vercel.app/",
    "branding": {
      "logo": "/images/pine/PineLogo.svg",
      "fonts": [
        { "name": "Oswald", "style": "Heading" },
        { "name": "Poppins", "style": "Body" }
      ],
      "colors": [
        { "hex": "#2B3F47" },
        { "hex": "#EFFFF8" },
        { "hex": "#C2EEE1" },
        { "hex": "#46757C" }
      ],
      "animation": "/images/pine/pine-animation.webm"
    },
    "caseStudySections": [
      {
        "heading": "Problem & Persona",
        "text": "Many people struggle with meal planning—whether it’s deciding where to eat or finding recipes that fit their dietary preferences and budget. **Pine** solves this by offering a streamlined web app that curates both restaurant suggestions and recipe recommendations based on user preferences. \n\nThe app is designed with accessibility and inclusivity in mind, ensuring a seamless experience for all users, including those with dietary restrictions and visual impairments."
      },
      {
        "heading": "Lo-Fi & User Flow",
        "text": "The project started with **market research and user personas** to shape the ideal user experience. Low-fidelity wireframes were created in Figma, mapping out key interactions such as onboarding, personalized meal selection, and restaurant discovery. \n\nThe user flow was designed to be intuitive—guiding users from an interactive quiz to tailored recommendations in just a few steps.",
        "figmaEmbedLink": "https://www.figma.com/file/CxUggvw8b9vrQTK2ioP5JE/MDIA-2106-Pine?node-id=1522-3685"
      },
      {
        "heading": "Branding & Style Guide",
        "text": "Pine's branding is clean, modern, and inviting. The **earthy color palette** enhances clarity and accessibility, while the **Oswald and Poppins** typefaces ensure readability with some personality. A **custom Lottie animation** of the Pine mascot flipping a pancake adds personality and engagement to loading screens."
      },
      {
        "heading": "Main Functionality",
        "text": "Pine offers **two core functions**:  \n **Restaurant Finder** – Users select a craving (Asian, Western, fast food, desserts, etc.), and Pine suggests nearby restaurants.  \n **Recipe Finder** – Users can browse recipes, view full ingredient lists, and follow step-by-step instructions.",
        "image": "/images/pine/2Phone.png"
      },
      {
        "heading": "Development & Integration",
        "text": "The app is powered by **Spoonacular API** for meal recommendations and **Google Maps API** for interactive restaurant listings. A **custom-built database** organizes dish data, and a graph component visualizes nutritional information in real-time."
      },
      {
        "heading": "Core Features",
        "text": "**Personalized Quiz** – Gathers user preferences for tailored recommendations.  \n**Restaurant Map (WOW Feature)** – Displays interactive restaurant cards using Google Maps API.  \n**Recipe & Shopping List** – Offers step-by-step instructions and an ingredient list."
      },
      {
        "heading": "Conclusion",
        "text": "Pine simplifies meal planning, ensuring users can quickly discover dining options or cook meals tailored to their needs. This project included a **strong balance of UI/UX design, branding, and technical development**, making it an accessible and user-friendly dining assistant."
      }
    ]
  },
  {
    "slug": "kenzo-tange-magazine",
    "title": "Kenzo Tange Magazine",
    "caseStudy": false,
    "image": "/images/kenzo-magazine/Thumbnail.jpg",
    "categories": ["Graphic Design", "Editorial Design", "Print"],
    "externalLink": "https://indd.adobe.com/view/fdf8a8d1-8f87-4529-892e-0b74825b4605",
    "year": 2024,
    "overview": "This magazine spread pays tribute to the architectural legacy of Kenzo Tange, a pioneering Japanese architect known for his innovative designs. The layout features a minimalist aesthetic, with a focus on clean lines and ample white space to reflect Tange’s modernist approach. The typography is bold and structured, mirroring the architectural elements of Tange’s work. The color palette is inspired by the materials used in his buildings, such as concrete and steel, creating a cohesive and harmonious design. Through thoughtful composition and attention to detail, this magazine spread captures the essence of Tange’s architectural vision and celebrates his lasting impact on the field.",
    "tools": ["Adobe InDesign", "Adobe Photoshop"],
    "images": [
        { "src": "/images/kenzo-magazine/SingleSpread.jpg", "type": "normal" },
        { "src": "/images/kenzo-magazine/Spreads.jpg", "type": "normal" }

      ],
    "upNext": {
      "slug": "fathom-summer-series",
      "title": "Fathom Summer Series",
      "image": "/images/can-design/ThreeCanMockup.png",
      "categories": ["Graphic Design", "Packaging", "Branding"]
    }
  },
  {
    "slug": "fathom-summer-series",
    "title": "Fathom Summer Series",
    "caseStudy": false,
    "image": "/images/can-design/ThreeCanMockup.jpg",
    "categories": ["Graphic Design", "Packaging", "Branding"],
    "year": 2024,
    "overview": "The Fathom Summer Series was created to capture the essence of summer through a line of craft beers, each inspired by a distinct time of day. Designed for Canadian consumers, the series balances vibrant visuals with bilingual labeling to meet packaging standards while reflecting the adventurous, geometric identity of the Fathom brand.\n\n### Bold, Geometric Design\nEach can features sharp, geometric fruit illustrations that align with Fathom’s brand style, emphasizing clean shapes and bold lines. Brand cohesion is maintained through this consistent aesthetic, with a unifying line graphic tying the series together.\n\n### Flavours Inspired by Summer\n- **Dawn Rise** (Blood Orange & Ginger Wheat Ale) captures the energy of morning.\n- **Golden Hour** (Mango & Pineapple Pale Ale) reflects the brightness of midday.\n- **Twilight Berry** (Blackberry & Lavender Saison) evokes the calm of twilight.\n\n### Custom Iconography\nIcons highlight key flavour profiles like crispness and malt, giving consumers a clear sense of what to expect while adding depth to the design.\n\n### Shelf Appeal\nWith vibrant colors, bold graphics, and a clear story, the Fathom Summer Series stands out on shelves, inviting consumers to experience the adventure of summer through Fathom’s unique lens.",
    "tools": ["Adobe Illustrator", "Adobe Photoshop"],
    "images": [
        { "src": "/images/can-design/TwilightBerryCanMock.jpg", "type": "can" },
        { "src": "/images/can-design/GoldenHourCanMock.jpg", "type": "can" },
        { "src": "/images/can-design/DawnRiseCanMock.jpg", "type": "can" },
        { "src": "/images/can-design/TwilightBerryDieline.png", "type": "dieline" },
        { "src": "/images/can-design/GoldenHourDieline.png", "type": "dieline" },
        { "src": "/images/can-design/DawnRiseDieline.png", "type": "dieline" }
      ],
    "upNext": {
      "slug": "coltrane-ellington",
      "title": "Coltrane and Ellington",
      "image": "/images/magazine/MagazineCoverImage.png",
      "categories": ["Graphic Design", "Poster"]
    }
  },
  {
    "slug": "coltrane-ellington",
    "title": "Coltrane and Ellington",
    "caseStudy": false,
    "image": "/images/jazz-poster/MagazineCoverImage.png",
    "categories": ["Graphic Design", "Poster"],
    "year": 2024,
    "overview": "This poster was created to honour jazz icons Duke Ellington and John Coltrane, blending retro and modern elements to pay tribute to their timeless legacy. The orange and purple color palette was chosen to reflect the original album artwork, creating a visual homage to their collaboration. The typeface used for their names draws inspiration from 1960s design trends while incorporating a contemporary twist, balancing nostalgia with modern aesthetics.\n\nTo integrate the sourced images seamlessly into the design, Coltrane and Ellington were posterized. This approach added elegance, enhanced balance, and unified the composition. The warm, dynamic visuals and bold typography create a striking design that captures the energy and sophistication of jazz. Perfect for music lovers and collectors, this poster serves as a fitting tribute to two of the greatest legends in jazz history.",
    "tools": ["Adobe Illustrator", "Adobe Photoshop"],
    "images":[
        { "src": "/images/jazz-poster/PostersUnderTheBridge.png", "type": "normal" },
        { "src": "/images/jazz-poster/BedroomMockup.png", "type": "normal" }
      ],
    "upNext": {
      "slug": "fathom-summer-series",
      "title": "Fathom Summer Series",
      "image": "/images/can-design/ThreeCanMockup.png",
      "categories": ["Graphic Design", "Packaging", "Branding"]
    }
  },
  {
    "slug": "Local-Harvest-Motion-Graphic",
    "title": "Local Harvest Motion Graphic",
    "caseStudy": false,
    "image": "/images/lh-animation/LHAnimationThumbnail.png",
    "categories": ["Marketing", "Motion Design", "Animation"],
    "externalLink": "https://drive.google.com/file/d/1NGq74N_F7ytIAaSJdT2AVRAGkOkd7Wa5/view?usp=sharing",
    "year": 2024,
    "overview": "This motion graphic promotes an app that connects farmers with consumers for pre-ordering goods before market day. It opens with contrasting scenes of overstocked and understocked stalls, immediately highlighting the common challenges farmers face. The narrative then shifts to a farmer discovering the app, followed by consumers placing orders, showcasing how the app reduces waste and improves planning. The video uses bright, geometric visuals and playful animations to make the app feel approachable and user-friendly. Happy customers emphasize the app’s role in building community connections. A cheerful, folk-inspired soundtrack and friendly voiceover create an inviting tone. By visually demonstrating the app’s benefits in a simple, engaging way, the motion graphic effectively captures attention and encourages both farmers and consumers to use Local Harvest.",
    "tools": ["Adobe Illustrator", "Adobe After Effects"],
    "upNext": {
      "slug": "fathom-summer-series",
      "title": "Fathom Summer Series",
      "image": "/images/can-design/ThreeCanMockup.png",
      "categories": ["Graphic Design", "Packaging", "Branding"]
    }
  }
]